In [74]:
import pandas as pd

In [75]:
df = pd.DataFrame(
    [[1, 2, 3],
    [4, 5, 6],
    [7, 8, 9]],
index=[1, 2, 3],
columns=["3", "4", "5"])

In [76]:
df

   3  4  5
1  1  2  3
2  4  5  6
3  7  8  9

In [77]:
df.dtypes

3    int64
4    int64
5    int64
dtype: object

In [78]:
pd.DataFrame(df)

   3  4  5
1  1  2  3
2  4  5  6
3  7  8  9

In [79]:
temp = [[1, 2, 3]]

In [80]:
pd.DataFrame(data = temp, index = [1, 2, 3], columns=[3, 4, 5])

   3  4  5
1  1  2  3
2  1  2  3
3  1  2  3

In [81]:
df = pd.DataFrame(
    data = {
    "a": [1, 2, 3],
    "b": [4, 5, 6],
    "c": [7, 8, 9]
    },
    index = [1, 2, 3],
)

In [82]:
df

   a  b  c
1  1  4  7
2  2  5  8
3  3  6  9

In [125]:
df = pd.DataFrame(
    data=[
        [1, 2, 3],
        [4, 5, 6],
        [7, 8, 9]
    ],
    index=[1, 2, 3], 
    columns=["a", "b", "c"]
)

In [126]:
df

   a  b  c
1  1  2  3
2  4  5  6
3  7  8  9

In [127]:
for item in df["a"]:
   item = 1

df

   a  b  c
1  1  2  3
2  4  5  6
3  7  8  9

In [121]:
df

<class 'pandas.core.frame.DataFrame'>

   a  b  c
1  1  2  3
2  1  5  6
3  1  8  9

In [128]:
for i in range(len(df["a"])):
    df.loc[i+1, "a"] = 1
    
df

   a  b  c
1  1  2  3
2  1  5  6
3  1  8  9

In [122]:
df

   a  b  c
1  1  2  3
2  1  5  6
3  1  8  9

In [131]:
df = pd.DataFrame(
    data=[
        [1, 2, 3],
        [4, 5, 6],
        [7, 8, 9]
    ],
    index=[1, 2, 3], 
    columns=["a", "b", "c"]
)

df

   a  b  c
1  1  2  3
2  4  5  6
3  7  8  9

In [139]:
df.loc[1, "b"]

2

In [140]:
df.loc[[1, 2, 3], ["a", "b", "c"]]

   a  b  c
1  1  2  3
2  4  5  6
3  7  8  9

In [142]:
df.loc[[True, False, True], [True, False, False]]

   a
1  1
3  7

In [144]:
df.loc[df["a"] >= 4]

   a  b  c
2  4  5  6
3  7  8  9

In [145]:
df.loc[1]

a    1
b    2
c    3
Name: 1, dtype: int64

In [150]:
df.iloc[[0, 1, 2], [0, 2]]

   a  c
1  1  3
2  4  6
3  7  9

In [152]:
df.iloc[0]

a    1
b    2
c    3
Name: 1, dtype: int64